// Generated by jextract

package com.microsoft.win32;

import java.lang.invoke.MethodHandle;
import java.lang.invoke.VarHandle;
import java.nio.ByteOrder;
import java.lang.foreign.*;
import static java.lang.foreign.ValueLayout.*;
/**
 * {@snippet :
 * struct _MIDL_STUB_MESSAGE {
 *     PRPC_MESSAGE RpcMsg;
 *     unsigned char* Buffer;
 *     unsigned char* BufferStart;
 *     unsigned char* BufferEnd;
 *     unsigned char* BufferMark;
 *     unsigned long BufferLength;
 *     unsigned long MemorySize;
 *     unsigned char* Memory;
 *     unsigned char IsClient;
 *     unsigned char Pad;
 *     unsigned short uFlags2;
 *     int ReuseBuffer;
 *     struct NDR_ALLOC_ALL_NODES_CONTEXT* pAllocAllNodesContext;
 *     struct NDR_POINTER_QUEUE_STATE* pPointerQueueState;
 *     int IgnoreEmbeddedPointers;
 *     unsigned char* PointerBufferMark;
 *     unsigned char CorrDespIncrement;
 *     unsigned char uFlags;
 *     unsigned short UniquePtrCount;
 *     ULONG_PTR MaxCount;
 *     unsigned long Offset;
 *     unsigned long ActualCount;
 *     void* (*pfnAllocate)(size_t);
 *     void (*pfnFree)(void*);
 *     unsigned char* StackTop;
 *     unsigned char* pPresentedType;
 *     unsigned char* pTransmitType;
 *     handle_t SavedHandle;
 *     struct _MIDL_STUB_DESC* StubDesc;
 *     struct _FULL_PTR_XLAT_TABLES* FullPtrXlatTables;
 *     unsigned long FullPtrRefId;
 *     unsigned long PointerLength;
 *      *     int fInDontFree;
 *     int fDontCallFreeInst;
 *     int fUnused1;
 *     int fHasReturn;
 *     int fHasExtensions;
 *     int fHasNewCorrDesc;
 *     int fIsIn;
 *     int fIsOut;
 *     int fIsOicf;
 *     int fBufferValid;
 *     int fHasMemoryValidateCallback;
 *     int fInFree;
 *     int fNeedMCCP;
 *     int fUnused2;
 *     int fUnused3;
 *     unsigned long dwDestContext;
 *     void* pvDestContext;
 *     NDR_SCONTEXT* SavedContextHandles;
 *     long ParamNumber;
 *     struct IRpcChannelBuffer* pRpcChannelBuffer;
 *     PARRAY_INFO pArrayInfo;
 *     unsigned long* SizePtrCountArray;
 *     unsigned long* SizePtrOffsetArray;
 *     unsigned long* SizePtrLengthArray;
 *     void* pArgQueue;
 *     unsigned long dwStubPhase;
 *     void* LowStackMark;
 *     PNDR_ASYNC_MESSAGE pAsyncMsg;
 *     PNDR_CORRELATION_INFO pCorrInfo;
 *     unsigned char* pCorrMemory;
 *     void* pMemoryList;
 *     INT_PTR pCSInfo;
 *     unsigned char* ConformanceMark;
 *     unsigned char* VarianceMark;
 *     INT_PTR Unused;
 *     struct _NDR_PROC_CONTEXT* pContext;
 *     void* ContextHandleHash;
 *     void* pUserMarshalList;
 *     INT_PTR Reserved51_3;
 *     INT_PTR Reserved51_4;
 *     INT_PTR Reserved51_5;
 * };
 * }
 */
public class _MIDL_STUB_MESSAGE {

    static final StructLayout $struct$LAYOUT = MemoryLayout.structLayout(
        Constants$root.C_POINTER$LAYOUT.withName("RpcMsg"),
        Constants$root.C_POINTER$LAYOUT.withName("Buffer"),
        Constants$root.C_POINTER$LAYOUT.withName("BufferStart"),
        Constants$root.C_POINTER$LAYOUT.withName("BufferEnd"),
        Constants$root.C_POINTER$LAYOUT.withName("BufferMark"),
        Constants$root.C_LONG$LAYOUT.withName("BufferLength"),
        Constants$root.C_LONG$LAYOUT.withName("MemorySize"),
        Constants$root.C_POINTER$LAYOUT.withName("Memory"),
        Constants$root.C_CHAR$LAYOUT.withName("IsClient"),
        Constants$root.C_CHAR$LAYOUT.withName("Pad"),
        Constants$root.C_SHORT$LAYOUT.withName("uFlags2"),
        Constants$root.C_LONG$LAYOUT.withName("ReuseBuffer"),
        Constants$root.C_POINTER$LAYOUT.withName("pAllocAllNodesContext"),
        Constants$root.C_POINTER$LAYOUT.withName("pPointerQueueState"),
        Constants$root.C_LONG$LAYOUT.withName("IgnoreEmbeddedPointers"),
        MemoryLayout.paddingLayout(32),
        Constants$root.C_POINTER$LAYOUT.withName("PointerBufferMark"),
        Constants$root.C_CHAR$LAYOUT.withName("CorrDespIncrement"),
        Constants$root.C_CHAR$LAYOUT.withName("uFlags"),
        Constants$root.C_SHORT$LAYOUT.withName("UniquePtrCount"),
        MemoryLayout.paddingLayout(32),
        Constants$root.C_LONG_LONG$LAYOUT.withName("MaxCount"),
        Constants$root.C_LONG$LAYOUT.withName("Offset"),
        Constants$root.C_LONG$LAYOUT.withName("ActualCount"),
        Constants$root.C_POINTER$LAYOUT.withName("pfnAllocate"),
        Constants$root.C_POINTER$LAYOUT.withName("pfnFree"),
        Constants$root.C_POINTER$LAYOUT.withName("StackTop"),
        Constants$root.C_POINTER$LAYOUT.withName("pPresentedType"),
        Constants$root.C_POINTER$LAYOUT.withName("pTransmitType"),
        Constants$root.C_POINTER$LAYOUT.withName("SavedHandle"),
        Constants$root.C_POINTER$LAYOUT.withName("StubDesc"),
        Constants$root.C_POINTER$LAYOUT.withName("FullPtrXlatTables"),
        Constants$root.C_LONG$LAYOUT.withName("FullPtrRefId"),
        Constants$root.C_LONG$LAYOUT.withName("PointerLength"),
        MemoryLayout.paddingLayout(32),
        Constants$root.C_LONG$LAYOUT.withName("dwDestContext"),
        Constants$root.C_POINTER$LAYOUT.withName("pvDestContext"),
        Constants$root.C_POINTER$LAYOUT.withName("SavedContextHandles"),
        Constants$root.C_LONG$LAYOUT.withName("ParamNumber"),
        MemoryLayout.paddingLayout(32),
        Constants$root.C_POINTER$LAYOUT.withName("pRpcChannelBuffer"),
        Constants$root.C_POINTER$LAYOUT.withName("pArrayInfo"),
        Constants$root.C_POINTER$LAYOUT.withName("SizePtrCountArray"),
        Constants$root.C_POINTER$LAYOUT.withName("SizePtrOffsetArray"),
        Constants$root.C_POINTER$LAYOUT.withName("SizePtrLengthArray"),
        Constants$root.C_POINTER$LAYOUT.withName("pArgQueue"),
        Constants$root.C_LONG$LAYOUT.withName("dwStubPhase"),
        MemoryLayout.paddingLayout(32),
        Constants$root.C_POINTER$LAYOUT.withName("LowStackMark"),
        Constants$root.C_POINTER$LAYOUT.withName("pAsyncMsg"),
        Constants$root.C_POINTER$LAYOUT.withName("pCorrInfo"),
        Constants$root.C_POINTER$LAYOUT.withName("pCorrMemory"),
        Constants$root.C_POINTER$LAYOUT.withName("pMemoryList"),
        Constants$root.C_LONG_LONG$LAYOUT.withName("pCSInfo"),
        Constants$root.C_POINTER$LAYOUT.withName("ConformanceMark"),
        Constants$root.C_POINTER$LAYOUT.withName("VarianceMark"),
        Constants$root.C_LONG_LONG$LAYOUT.withName("Unused"),
        Constants$root.C_POINTER$LAYOUT.withName("pContext"),
        Constants$root.C_POINTER$LAYOUT.withName("ContextHandleHash"),
        Constants$root.C_POINTER$LAYOUT.withName("pUserMarshalList"),
        Constants$root.C_LONG_LONG$LAYOUT.withName("Reserved51_3"),
        Constants$root.C_LONG_LONG$LAYOUT.withName("Reserved51_4"),
