// Generated by jextract

package com.microsoft.win32;

import java.lang.invoke.MethodHandle;
import java.lang.invoke.VarHandle;
import java.nio.ByteOrder;
import java.lang.foreign.*;
import static java.lang.foreign.ValueLayout.*;
/**
 * {@snippet :
 * struct _NTFS_STATISTICS_EX {
 *     DWORD LogFileFullExceptions;
 *     DWORD OtherExceptions;
 *     DWORDLONG MftReads;
 *     DWORDLONG MftReadBytes;
 *     DWORDLONG MftWrites;
 *     DWORDLONG MftWriteBytes;
 *     struct  MftWritesUserLevel;
 *     DWORD MftWritesFlushForLogFileFull;
 *     DWORD MftWritesLazyWriter;
 *     DWORD MftWritesUserRequest;
 *     DWORDLONG Mft2Writes;
 *     DWORDLONG Mft2WriteBytes;
 *     struct  Mft2WritesUserLevel;
 *     DWORD Mft2WritesFlushForLogFileFull;
 *     DWORD Mft2WritesLazyWriter;
 *     DWORD Mft2WritesUserRequest;
 *     DWORDLONG RootIndexReads;
 *     DWORDLONG RootIndexReadBytes;
 *     DWORDLONG RootIndexWrites;
 *     DWORDLONG RootIndexWriteBytes;
 *     DWORDLONG BitmapReads;
 *     DWORDLONG BitmapReadBytes;
 *     DWORDLONG BitmapWrites;
 *     DWORDLONG BitmapWriteBytes;
 *     DWORD BitmapWritesFlushForLogFileFull;
 *     DWORD BitmapWritesLazyWriter;
 *     DWORD BitmapWritesUserRequest;
 *     struct  BitmapWritesUserLevel;
 *     DWORDLONG MftBitmapReads;
 *     DWORDLONG MftBitmapReadBytes;
 *     DWORDLONG MftBitmapWrites;
 *     DWORDLONG MftBitmapWriteBytes;
 *     DWORD MftBitmapWritesFlushForLogFileFull;
 *     DWORD MftBitmapWritesLazyWriter;
 *     DWORD MftBitmapWritesUserRequest;
 *     struct  MftBitmapWritesUserLevel;
 *     DWORDLONG UserIndexReads;
 *     DWORDLONG UserIndexReadBytes;
 *     DWORDLONG UserIndexWrites;
 *     DWORDLONG UserIndexWriteBytes;
 *     DWORDLONG LogFileReads;
 *     DWORDLONG LogFileReadBytes;
 *     DWORDLONG LogFileWrites;
 *     DWORDLONG LogFileWriteBytes;
 *     struct  Allocate;
 *     DWORD DiskResourcesExhausted;
 *     DWORDLONG VolumeTrimCount;
 *     DWORDLONG VolumeTrimTime;
 *     DWORDLONG VolumeTrimByteCount;
 *     DWORDLONG FileLevelTrimCount;
 *     DWORDLONG FileLevelTrimTime;
 *     DWORDLONG FileLevelTrimByteCount;
 *     DWORDLONG VolumeTrimSkippedCount;
 *     DWORDLONG VolumeTrimSkippedByteCount;
 *     DWORDLONG NtfsFillStatInfoFromMftRecordCalledCount;
 *     DWORDLONG NtfsFillStatInfoFromMftRecordBailedBecauseOfAttributeListCount;
 *     DWORDLONG NtfsFillStatInfoFromMftRecordBailedBecauseOfNonResReparsePointCount;
 * };
 * }
 */
public class _NTFS_STATISTICS_EX {

    static final StructLayout $struct$LAYOUT = MemoryLayout.structLayout(
        Constants$root.C_LONG$LAYOUT.withName("LogFileFullExceptions"),
        Constants$root.C_LONG$LAYOUT.withName("OtherExceptions"),
        Constants$root.C_LONG_LONG$LAYOUT.withName("MftReads"),
        Constants$root.C_LONG_LONG$LAYOUT.withName("MftReadBytes"),
        Constants$root.C_LONG_LONG$LAYOUT.withName("MftWrites"),
        Constants$root.C_LONG_LONG$LAYOUT.withName("MftWriteBytes"),
        MemoryLayout.structLayout(
            Constants$root.C_LONG$LAYOUT.withName("Write"),
            Constants$root.C_LONG$LAYOUT.withName("Create"),
            Constants$root.C_LONG$LAYOUT.withName("SetInfo"),
            Constants$root.C_LONG$LAYOUT.withName("Flush")
        ).withName("MftWritesUserLevel"),
        Constants$root.C_LONG$LAYOUT.withName("MftWritesFlushForLogFileFull"),
        Constants$root.C_LONG$LAYOUT.withName("MftWritesLazyWriter"),
        Constants$root.C_LONG$LAYOUT.withName("MftWritesUserRequest"),
        MemoryLayout.paddingLayout(32),
        Constants$root.C_LONG_LONG$LAYOUT.withName("Mft2Writes"),
        Constants$root.C_LONG_LONG$LAYOUT.withName("Mft2WriteBytes"),
        MemoryLayout.structLayout(
            Constants$root.C_LONG$LAYOUT.withName("Write"),
            Constants$root.C_LONG$LAYOUT.withName("Create"),
            Constants$root.C_LONG$LAYOUT.withName("SetInfo"),
            Constants$root.C_LONG$LAYOUT.withName("Flush")
        ).withName("Mft2WritesUserLevel"),
        Constants$root.C_LONG$LAYOUT.withName("Mft2WritesFlushForLogFileFull"),
        Constants$root.C_LONG$LAYOUT.withName("Mft2WritesLazyWriter"),
        Constants$root.C_LONG$LAYOUT.withName("Mft2WritesUserRequest"),
        MemoryLayout.paddingLayout(32),
        Constants$root.C_LONG_LONG$LAYOUT.withName("RootIndexReads"),
        Constants$root.C_LONG_LONG$LAYOUT.withName("RootIndexReadBytes"),
        Constants$root.C_LONG_LONG$LAYOUT.withName("RootIndexWrites"),
        Constants$root.C_LONG_LONG$LAYOUT.withName("RootIndexWriteBytes"),
        Constants$root.C_LONG_LONG$LAYOUT.withName("BitmapReads"),
        Constants$root.C_LONG_LONG$LAYOUT.withName("BitmapReadBytes"),
        Constants$root.C_LONG_LONG$LAYOUT.withName("BitmapWrites"),
        Constants$root.C_LONG_LONG$LAYOUT.withName("BitmapWriteBytes"),
        Constants$root.C_LONG$LAYOUT.withName("BitmapWritesFlushForLogFileFull"),
        Constants$root.C_LONG$LAYOUT.withName("BitmapWritesLazyWriter"),
        Constants$root.C_LONG$LAYOUT.withName("BitmapWritesUserRequest"),
        MemoryLayout.structLayout(
            Constants$root.C_LONG$LAYOUT.withName("Write"),
            Constants$root.C_LONG$LAYOUT.withName("Create"),
            Constants$root.C_LONG$LAYOUT.withName("SetInfo"),
            Constants$root.C_LONG$LAYOUT.withName("Flush")
        ).withName("BitmapWritesUserLevel"),
        MemoryLayout.paddingLayout(32),
        Constants$root.C_LONG_LONG$LAYOUT.withName("MftBitmapReads"),
        Constants$root.C_LONG_LONG$LAYOUT.withName("MftBitmapReadBytes"),
        Constants$root.C_LONG_LONG$LAYOUT.withName("MftBitmapWrites"),
        Constants$root.C_LONG_LONG$LAYOUT.withName("MftBitmapWriteBytes"),
        Constants$root.C_LONG$LAYOUT.withName("MftBitmapWritesFlushForLogFileFull"),
        Constants$root.C_LONG$LAYOUT.withName("MftBitmapWritesLazyWriter"),
        Constants$root.C_LONG$LAYOUT.withName("MftBitmapWritesUserRequest"),
        MemoryLayout.structLayout(
            Constants$root.C_LONG$LAYOUT.withName("Write"),
            Constants$root.C_LONG$LAYOUT.withName("Create"),
            Constants$root.C_LONG$LAYOUT.withName("SetInfo"),
            Constants$root.C_LONG$LAYOUT.withName("Flush")
        ).withName("MftBitmapWritesUserLevel"),
        MemoryLayout.paddingLayout(32),
        Constants$root.C_LONG_LONG$LAYOUT.withName("UserIndexReads"),
        Constants$root.C_LONG_LONG$LAYOUT.withName("UserIndexReadBytes"),
        Constants$root.C_LONG_LONG$LAYOUT.withName("UserIndexWrites"),
        Constants$root.C_LONG_LONG$LAYOUT.withName("UserIndexWriteBytes"),
        Constants$root.C_LONG_LONG$LAYOUT.withName("LogFileReads"),
        Constants$root.C_LONG_LONG$LAYOUT.withName("LogFileReadBytes"),
        Constants$root.C_LONG_LONG$LAYOUT.withName("LogFileWrites"),
        Constants$root.C_LONG_LONG$LAYOUT.withName("LogFileWriteBytes"),
        MemoryLayout.structLayout(
            Constants$root.C_LONG$LAYOUT.withName("Calls"),
            Constants$root.C_LONG$LAYOUT.withName("RunsReturned"),
            Constants$root.C_LONG$LAYOUT.withName("Hints"),
            Constants$root.C_LONG$LAYOUT.withName("HintsHonored"),
            Constants$root.C_LONG$LAYOUT.withName("Cache"),
            Constants$root.C_LONG$LAYOUT.withName("CacheMiss"),
            Constants$root.C_LONG_LONG$LAYOUT.withName("Clusters"),
            Constants$root.C_LONG_LONG$LAYOUT.withName("HintsClusters"),
            Constants$root.C_LONG_LONG$LAYOUT.withName("CacheClusters"),
            Constants$root.C_LONG_LONG$LAYOUT.withName("CacheMissClusters")
        ).withName("Allocate"),
        Constants$root.C_LONG$LAYOUT.withName("DiskResourcesExhausted"),
        MemoryLayout.paddingLayout(32),
        Constants$root.C_LONG_LONG$LAYOUT.withName("VolumeTrimCount"),
        Constants$root.C_LONG_LONG$LAYOUT.withName("VolumeTrimTime"),
        Constants$root.C_LONG_LONG$LAYOUT.withName("VolumeTrimByteCount"),
        Constants$root.C_LONG_LONG$LAYOUT.withName("FileLevelTrimCount"),
        Constants$root.C_LONG_LONG$LAYOUT.withName("FileLevelTrimTime"),
        Constants$root.C_LONG_LONG$LAYOUT.withName("FileLevelTrimByteCount"),
        Constants$root.C_LONG_LONG$LAYOUT.withName("VolumeTrimSkippedCount"),
        Constants$root.C_LONG_LONG$LAYOUT.withName("VolumeTrimSkippedByteCount"),
        Constants$root.C_LONG_LONG$LAYOUT.withName("NtfsFillStatInfoFromMftRecordCalledCount"),
        Constants$root.C_LONG_LONG$LAYOUT.withName("NtfsFillStatInfoFromMftRecordBailedBecauseOfAttributeListCount"),
        Constants$root.C_LONG_LONG$LAYOUT.withName("NtfsFillStatInfoFromMftRecordBailedBecauseOfNonResReparsePointCount")
