// Generated by jextract

package com.microsoft.win32;

import java.lang.invoke.MethodHandle;
import java.lang.invoke.VarHandle;
import java.nio.ByteOrder;
import java.lang.foreign.*;
import static java.lang.foreign.ValueLayout.*;
/**
 * {@snippet :
 * struct _OCSP_BASIC_RESPONSE_ENTRY {
 *     OCSP_CERT_ID CertId;
 *     DWORD dwCertStatus;
 *     union {
 *         POCSP_BASIC_REVOKED_INFO pRevokedInfo;
 *     };
 *     FILETIME ThisUpdate;
 *     FILETIME NextUpdate;
 *     DWORD cExtension;
 *     PCERT_EXTENSION rgExtension;
 * };
 * }
 */
public class _OCSP_BASIC_RESPONSE_ENTRY {

    static final StructLayout $struct$LAYOUT = MemoryLayout.structLayout(
        MemoryLayout.structLayout(
            MemoryLayout.structLayout(
                Constants$root.C_POINTER$LAYOUT.withName("pszObjId"),
                MemoryLayout.structLayout(
                    Constants$root.C_LONG$LAYOUT.withName("cbData"),
                    MemoryLayout.paddingLayout(32),
                    Constants$root.C_POINTER$LAYOUT.withName("pbData")
                ).withName("Parameters")
            ).withName("HashAlgorithm"),
            MemoryLayout.structLayout(
                Constants$root.C_LONG$LAYOUT.withName("cbData"),
                MemoryLayout.paddingLayout(32),
                Constants$root.C_POINTER$LAYOUT.withName("pbData")
            ).withName("IssuerNameHash"),
            MemoryLayout.structLayout(
                Constants$root.C_LONG$LAYOUT.withName("cbData"),
                MemoryLayout.paddingLayout(32),
                Constants$root.C_POINTER$LAYOUT.withName("pbData")
            ).withName("IssuerKeyHash"),
            MemoryLayout.structLayout(
                Constants$root.C_LONG$LAYOUT.withName("cbData"),
                MemoryLayout.paddingLayout(32),
                Constants$root.C_POINTER$LAYOUT.withName("pbData")
            ).withName("SerialNumber")
        ).withName("CertId"),
        Constants$root.C_LONG$LAYOUT.withName("dwCertStatus"),
        MemoryLayout.paddingLayout(32),
        MemoryLayout.unionLayout(
            Constants$root.C_POINTER$LAYOUT.withName("pRevokedInfo")
        ).withName("$anon$0"),
        MemoryLayout.structLayout(
            Constants$root.C_LONG$LAYOUT.withName("dwLowDateTime"),
            Constants$root.C_LONG$LAYOUT.withName("dwHighDateTime")
        ).withName("ThisUpdate"),
        MemoryLayout.structLayout(
            Constants$root.C_LONG$LAYOUT.withName("dwLowDateTime"),
            Constants$root.C_LONG$LAYOUT.withName("dwHighDateTime")
        ).withName("NextUpdate"),
        Constants$root.C_LONG$LAYOUT.withName("cExtension"),
        MemoryLayout.paddingLayout(32),
        Constants$root.C_POINTER$LAYOUT.withName("rgExtension")
    ).withName("_OCSP_BASIC_RESPONSE_ENTRY");
    public static MemoryLayout $LAYOUT() {
        return _OCSP_BASIC_RESPONSE_ENTRY.$struct$LAYOUT;
    }
    public static MemorySegment CertId$slice(MemorySegment seg) {
        return seg.asSlice(0, 72);
    }
    static final VarHandle dwCertStatus$VH = $struct$LAYOUT.varHandle(MemoryLayout.PathElement.groupElement("dwCertStatus"));
    public static VarHandle dwCertStatus$VH() {
        return _OCSP_BASIC_RESPONSE_ENTRY.dwCertStatus$VH;
    }
    /**
     * Getter for field:
     * {@snippet :
     * DWORD dwCertStatus;
     * }
     */
    public static int dwCertStatus$get(MemorySegment seg) {
        return (int)_OCSP_BASIC_RESPONSE_ENTRY.dwCertStatus$VH.get(seg);
    }
    /**
     * Setter for field:
     * {@snippet :
     * DWORD dwCertStatus;
     * }
     */
    public static void dwCertStatus$set(MemorySegment seg, int x) {
        _OCSP_BASIC_RESPONSE_ENTRY.dwCertStatus$VH.set(seg, x);
    }
    public static int dwCertStatus$get(MemorySegment seg, long index) {
        return (int)_OCSP_BASIC_RESPONSE_ENTRY.dwCertStatus$VH.get(seg.asSlice(index*sizeof()));
    }
    public static void dwCertStatus$set(MemorySegment seg, long index, int x) {
        _OCSP_BASIC_RESPONSE_ENTRY.dwCertStatus$VH.set(seg.asSlice(index*sizeof()), x);
    }
    static final VarHandle pRevokedInfo$VH = $struct$LAYOUT.varHandle(MemoryLayout.PathElement.groupElement("$anon$0"), MemoryLayout.PathElement.groupElement("pRevokedInfo"));
    public static VarHandle pRevokedInfo$VH() {
        return _OCSP_BASIC_RESPONSE_ENTRY.pRevokedInfo$VH;
    }
    /**
     * Getter for field:
     * {@snippet :
     * POCSP_BASIC_REVOKED_INFO pRevokedInfo;
     * }
     */
    public static MemorySegment pRevokedInfo$get(MemorySegment seg) {
        return (java.lang.foreign.MemorySegment)_OCSP_BASIC_RESPONSE_ENTRY.pRevokedInfo$VH.get(seg);
    }
    /**
     * Setter for field:
     * {@snippet :
     * POCSP_BASIC_REVOKED_INFO pRevokedInfo;
     * }
     */
    public static void pRevokedInfo$set(MemorySegment seg, MemorySegment x) {
        _OCSP_BASIC_RESPONSE_ENTRY.pRevokedInfo$VH.set(seg, x);
    }
    public static MemorySegment pRevokedInfo$get(MemorySegment seg, long index) {
        return (java.lang.foreign.MemorySegment)_OCSP_BASIC_RESPONSE_ENTRY.pRevokedInfo$VH.get(seg.asSlice(index*sizeof()));
    }
    public static void pRevokedInfo$set(MemorySegment seg, long index, MemorySegment x) {
        _OCSP_BASIC_RESPONSE_ENTRY.pRevokedInfo$VH.set(seg.asSlice(index*sizeof()), x);
    }
    public static MemorySegment ThisUpdate$slice(MemorySegment seg) {
        return seg.asSlice(88, 8);
    }
    public static MemorySegment NextUpdate$slice(MemorySegment seg) {
        return seg.asSlice(96, 8);
    }
    static final VarHandle cExtension$VH = $struct$LAYOUT.varHandle(MemoryLayout.PathElement.groupElement("cExtension"));
    public static VarHandle cExtension$VH() {
        return _OCSP_BASIC_RESPONSE_ENTRY.cExtension$VH;
    }
    /**
     * Getter for field:
     * {@snippet :
     * DWORD cExtension;
     * }
     */
    public static int cExtension$get(MemorySegment seg) {
        return (int)_OCSP_BASIC_RESPONSE_ENTRY.cExtension$VH.get(seg);
    }
    /**
     * Setter for field:
     * {@snippet :
     * DWORD cExtension;
     * }
     */
    public static void cExtension$set(MemorySegment seg, int x) {
        _OCSP_BASIC_RESPONSE_ENTRY.cExtension$VH.set(seg, x);
    }
    public static int cExtension$get(MemorySegment seg, long index) {
        return (int)_OCSP_BASIC_RESPONSE_ENTRY.cExtension$VH.get(seg.asSlice(index*sizeof()));
    }
    public static void cExtension$set(MemorySegment seg, long index, int x) {
        _OCSP_BASIC_RESPONSE_ENTRY.cExtension$VH.set(seg.asSlice(index*sizeof()), x);
    }
    static final VarHandle rgExtension$VH = $struct$LAYOUT.varHandle(MemoryLayout.PathElement.groupElement("rgExtension"));
    public static VarHandle rgExtension$VH() {
        return _OCSP_BASIC_RESPONSE_ENTRY.rgExtension$VH;
    }
    /**
     * Getter for field:
     * {@snippet :
     * PCERT_EXTENSION rgExtension;
     * }
     */
    public static MemorySegment rgExtension$get(MemorySegment seg) {
        return (java.lang.foreign.MemorySegment)_OCSP_BASIC_RESPONSE_ENTRY.rgExtension$VH.get(seg);
    }
    /**
     * Setter for field:
     * {@snippet :
     * PCERT_EXTENSION rgExtension;
     * }
     */
    public static void rgExtension$set(MemorySegment seg, MemorySegment x) {
        _OCSP_BASIC_RESPONSE_ENTRY.rgExtension$VH.set(seg, x);
    }
    public static MemorySegment rgExtension$get(MemorySegment seg, long index) {
        return (java.lang.foreign.MemorySegment)_OCSP_BASIC_RESPONSE_ENTRY.rgExtension$VH.get(seg.asSlice(index*sizeof()));
    }
    public static void rgExtension$set(MemorySegment seg, long index, MemorySegment x) {
        _OCSP_BASIC_RESPONSE_ENTRY.rgExtension$VH.set(seg.asSlice(index*sizeof()), x);
    }
    public static long sizeof() { return $LAYOUT().byteSize(); }
    public static MemorySegment allocate(SegmentAllocator allocator) { return allocator.allocate($LAYOUT()); }
    public static MemorySegment allocateArray(long len, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(len, $LAYOUT()));
    }
    public static MemorySegment ofAddress(MemorySegment addr, SegmentScope scope) { return RuntimeHelper.asArray(addr, $LAYOUT(), 1, scope); }
}


